src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_Урок/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//первичное заполнение и обновление данных расширения — при первом открытии журнала уроков
	УЗ_ОбновлениеДанных.ОбновитьДанныеПриНеобходимости();
	ПроблемаОбновления = УЗ_ОбновлениеДанных.ПроблемаОбновления();
	Если Не ПустаяСтрока(ПроблемаОбновления) Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(ПроблемаОбновления);
	КонецЕсли;

	Если ОтображатьДиаграммуЗадолженности Тогда
		ПостроитьДиаграмму();
	КонецЕсли;
	
	Если ОтображатьБлижайшиеДниРождения Тогда
		СформироватьСписокДнейРождений();
	КонецЕсли;
	
	//Ф = ПолучитьТекущийСеансИнформационнойБазы().ИмяПриложения;
	//СеансыИБ = ПолучитьСеансыИнформационнойБазы();        
	//Для Каждого Сеанс Из СеансыИБ Цикл         
	//	Если Сеанс.НомерСоединения = ПолучитьТекущийСеансИнформационнойБазы().НомерСоединения Тогда
	//		//ИмяПриложения = Сеанс.ИмяПриложения;
	//		ВидКлиента = Сеанс.ИмяПриложения;//Строка(ПредставлениеПриложения(Сеанс.ИмяПриложения));
	//	КонецЕсли;   
	//КонецЦикла;
	//
	//Сообщить(ВидКлиента);
	//
	//ВидКлиента = "";
	//#Если ВебКлиент Тогда
	//	ВидКлиента = "ВебКлиент";
	//#ИначеЕсли Клиент Тогда
	//	ВидКлиента = "Клиент";		
	//#ИначеЕсли ВнешнееСоединение Тогда
	//	ВидКлиента = "ВнешнееСоединение";		
	//#ИначеЕсли ТонкийКлиент Тогда
	//	ВидКлиента = "ТонкийКлиент";		
	//#ИначеЕсли МобильныйКлиент Тогда
	//	ВидКлиента = "МобильныйКлиент";
	//#Иначе
	//	ВидКлиента = "Неопределен";
	//#КонецЕсли
	//
	//Если ВидКлиента = "MobileClient" Тогда
	//	Элементы.ГруппаНастройка.Видимость = Ложь;
	//	//ОтображатьБлижайшиеДниРождения = Ложь;
	//	//ОтображатьДиаграммуЗадолженности = Ложь;
	//КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Расшифровка.ТекущиеДанные;
	ТекДанныеСписок = Элементы.Список.ТекущиеДанные;
	
	Если Поле.Имя = "РасшифровкаУченик" Тогда
		Значение = ТекДанные.Ученик;
		ПоказатьЗначение(,Значение);
	ИначеЕсли Поле.Имя = "РасшифровкаАбонемент" Тогда
		Значение = ТекДанные.Абонемент;
		ПоказатьЗначение(,Значение);                        
	//ИначеЕсли Поле.Имя = "РасшифровкаСуммаОстаток" Тогда
	//	ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере(Элементы.Расшифровка.ТекущиеДанные.Ученик);
	//	ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);
	ИначеЕсли Поле.Имя = "РасшифровкаСуммаОстатокПоПредмету" Тогда
		ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере(ТекДанные.Ученик, ТекДанныеСписок.ПредметОбучения);
		ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);		
	Иначе
		ПоказатьЗначение(,Элементы.Список.ТекущаяСтрока);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	//детализация работает и в веб-клиенте (прежде там отметка включалась сама, а таблица не пряталась —
	//под списком оставались ученики чужого урока)
	Если НеОтображатьДетализациюУрока = Ложь Тогда 		
		Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			
			Расшифровка.Отбор.Элементы.Очистить();
			ЭлементОтбора = Расшифровка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Неопределено;
			ЭлементОтбора = Расшифровка.Отбор.Элементы[0];
			ЭлементОтбора.Использование = Истина;
			Элементы.Расшифровка.Обновить();
			
		Иначе
			
			Урок = Элементы.Список.ТекущаяСтрока;
			Расшифровка.Отбор.Элементы.Очистить();
			ЭлементОтбора = Расшифровка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Урок;
			ЭлементОтбора = Расшифровка.Отбор.Элементы[0];
			ЭлементОтбора.Использование = Истина;
			Элементы.Расшифровка.Обновить();
			
			//Расшифровка.Параметры.УстановитьЗначениеПараметра("Ссылка",Элементы.Список.ТекущаяСтрока);
			
		КонецЕсли; 		
	КонецЕсли; 	

КонецПроцедуры 

&НаКлиенте
Процедура ПомощникСозданияУроков(Команда)
	ОткрытьФорму("Документ.УЗ_Урок.Форма.ПомощникСозданияУроков",,,,); 
КонецПроцедуры

&НаКлиенте
Процедура УченикПриИзменении(Элемент)
	Абонемент = Неопределено;
	УченикПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АбонементПриИзменении(Элемент)
	Ученик = Неопределено;
	АбонементПриИзмененииНаСервере();
КонецПроцедуры

Процедура АбонементПриИзмененииНаСервере()
	
	Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(Абонемент) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ученики.Абонемент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Абонемент;
		ЭлементОтбора = Список.Отбор.Элементы[0];
		ЭлементОтбора.Использование = Истина;
		Элементы.Список.Обновить();		
	Иначе		
		Элементы.Список.Обновить();		
	КонецЕсли;   
	
КонецПроцедуры

Процедура УченикПриИзмененииНаСервере()
	
	Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(Ученик) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ученики.Ученик");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Ученик;
		ЭлементОтбора = Список.Отбор.Элементы[0];
		ЭлементОтбора.Использование = Истина;
		Элементы.Список.Обновить();		
	Иначе		
		Элементы.Список.Обновить();		
	КонецЕсли;   
	
КонецПроцедуры

//Должники — УЗ_Сервер.Должники: одно правило с оповещениями о долге — по организациям (В12: аванс в одной
//организации не гасит долг в другой), без педагогов. Ученик с долгами в двух организациях — две серии
//«ученик (организация)».
Процедура ПостроитьДиаграмму()

	Диаграмма.Очистить();
	ТЗ = УЗ_Сервер.Должники();
	НесколькоОрганизаций = ТЗ.Скопировать(, "Организация");
	НесколькоОрганизаций.Свернуть("Организация");

	Точка = Диаграмма.Точки.Добавить("");

	Для Каждого СтрТЗ из ТЗ Цикл

		Подпись = ?(НесколькоОрганизаций.Количество() > 1, СтрШаблон("%1 (%2)", СтрТЗ.Клиент, СтрТЗ.Организация), Строка(СтрТЗ.Клиент));
		Серия = Диаграмма.Серии.Добавить();
		Серия.Значение 		= СтрТЗ.Клиент;
		Серия.Текст 		= Подпись + " " + Формат(СтрТЗ.Долг, "ЧДЦ=2; ЧФ=(Ч)");
		Серия.Расшифровка 	= СтрТЗ.Клиент;

		Диаграмма.УстановитьЗначение(Точка, Серия, СтрТЗ.Долг, СтрТЗ.Клиент);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытьФормуНастройкиСписка" Тогда
		//ЗаполнитьЗначенияСвойств(ЭтотОбъект,Параметр);
		//ОбновитьФормуНаКлиенте();
	ИначеЕсли ИмяСобытия = "ЗакрытьФормуУрока" Тогда
		Урок = Элементы.Список.ТекущаяСтрока;
		Расшифровка.Отбор.Элементы.Очистить();
		ЭлементОтбора = Расшифровка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Урок;
		ЭлементОтбора = Расшифровка.Отбор.Элементы[0];
		ЭлементОтбора.Использование = Истина;
		Элементы.Расшифровка.Обновить();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуНаКлиенте()
	
	Если ОтображатьБлижайшиеДниРождения Тогда
		СформироватьСписокДнейРождений();
		Элементы.ГруппаДниРождения.Видимость = Истина;
	Иначе
		Элементы.ГруппаДниРождения.Видимость = Ложь;
	КонецЕсли;
	
	Если ОтображатьДиаграммуЗадолженности Тогда
		ПостроитьДиаграмму();
		Элементы.ГруппаДолжники.Видимость = Истина;
	Иначе
		Элементы.ГруппаДолжники.Видимость = Ложь;
	КонецЕсли;
	
	Если НеОтображатьДетализациюУрока Тогда
		Элементы.Расшифровка.Видимость = Ложь;
	Иначе
		Элементы.Расшифровка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОткрытьВзаиморасчетыНаСервере(Значение, ПредметОбучения = Неопределено)
	
	КомпоновщикНастроек = Отчеты.УЗ_Взаиморасчеты.Создать().КомпоновщикНастроек; 
	Настройки 			= КомпоновщикНастроек.Настройки; 
	
	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")); 
	Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда 
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки); 
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 
			ПользовательскийПараметр.Использование = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	ОтборУченик 			= Новый ПолеКомпоновкиДанных("Клиент");
	ОтборПредметОбучения 	= Новый ПолеКомпоновкиДанных("ПредметОбучения");
	
	Для Каждого ЭлементНастройки Из Настройки.Отбор.Элементы Цикл 
		
		Если ЭлементНастройки.ЛевоеЗначение = ОтборУченик Тогда 
			ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементНастройки.ПравоеЗначение = Значение; 
			ЭлементНастройки.Использование = Истина; 
			Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда 
				ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки); 
				Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
					ПользовательскийПараметр.ВидСравнения = ЭлементНастройки.ВидСравнения; 
					ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение; 
					ПользовательскийПараметр.Использование = ЭлементНастройки.Использование; 
				КонецЕсли; 
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ПредметОбучения) Тогда
				Прервать
			КонецЕсли; 			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПредметОбучения) Тогда
			
			Если ЭлементНастройки.ЛевоеЗначение = ОтборПредметОбучения Тогда 
				ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
				ЭлементНастройки.ПравоеЗначение = ПредметОбучения; 
				ЭлементНастройки.Использование = Истина; 
				Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда 
					ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки); 
					Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
						ПользовательскийПараметр.ВидСравнения = ЭлементНастройки.ВидСравнения; 
						ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение; 
						ПользовательскийПараметр.Использование = ЭлементНастройки.Использование; 
					КонецЕсли; 
				КонецЕсли;				
				Прервать
			КонецЕсли;			
		КонецЕсли;
		
	КонецЦикла; 
	
	ПараметрыОткрытия = Новый Структура(); 
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина); 
	ПараметрыОткрытия.Вставить("Вариант", Настройки); 
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки); 
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьВзаиморасчеты(Команда)
	
	Если ЗначениеЗаполнено(Ученик) Тогда		
		ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере(Ученик);
		ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);
	Иначе
		ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", , ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВзаиморасчетыКонтекст(Команда)
	
	ТекДанные = Элементы.Расшифровка.ТекущиеДанные;
	
	ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере(ТекДанные.Ученик);
	ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПанельУченика(Команда)
	
	ОткрытьФорму("Обработка.УЗ_ПанельУченика.Форма.Форма", , ЭтаФорма);
	
КонецПроцедуры

//Дни рождения сегодня и в ближайшие 10 дней — Справочники.УЗ_ФизЛица.ДниРождения: «Осталось дней» по дате
//(29 февраля в невисокосный год — 1 марта), «Исполнится» — от даты рождения (было: хранимый «Возраст», устаревал),
//выбывшие не показываются.
Процедура СформироватьСписокДнейРождений()

	ДниРождения.Очистить();
	Для Каждого СтрокаДня Из Справочники.УЗ_ФизЛица.ДниРождения(ТекущаяДатаСеанса(), 10) Цикл
		НоваяСтрока = ДниРождения.Добавить();
		НоваяСтрока.ФизЛицо = СтрокаДня.ФизЛицо;
		НоваяСтрока.Дата = СтрокаДня.Дата;
		НоваяСтрока.ДеньГода = ДеньГода(СтрокаДня.Дата);
		НоваяСтрока.Возраст = СтрокаДня.Исполнится;
		НоваяСтрока.ОсталосьДней = СтрокаДня.ОсталосьДней;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидКлиента = "";
	//#Если ВебКлиент Тогда
	//	ВидКлиента = "ВебКлиент";
	//#ИначеЕсли Клиент Тогда
	//	ВидКлиента = "Клиент";		
	//#ИначеЕсли ВнешнееСоединение Тогда
	//	ВидКлиента = "ВнешнееСоединение";		
	//#ИначеЕсли ТонкийКлиент Тогда
	//	ВидКлиента = "ТонкийКлиент";		
	#Если МобильныйКлиент Тогда
		ВидКлиента = "МобильныйКлиент";
	//#Иначе
	//	ВидКлиента = "Неопределен";
	#КонецЕсли
	
	//Сообщить(ВидКлиента+ " " +ВидКлиента2);
	
	Если ВидКлиента = "МобильныйКлиент" Тогда
		Элементы.ГруппаНастройка.Видимость = Ложь;
		//ОтображатьБлижайшиеДниРождения = Ложь;
		//ОтображатьДиаграммуЗадолженности = Ложь;
	КонецЕсли;	
	
	ОбновитьФормуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененийНайстроек(Элемент)
	ОбновитьФормуНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "Педагог" Тогда
		СтандартнаяОбработка = Ложь;
		Значение = Элементы.Список.ТекущиеДанные.Педагог;
		ПоказатьЗначение(,Значение);
	Иначе
		//ПоказатьЗначение(,Элементы.Список.ТекущаяСтрока);		
	КонецЕсли;
	
КонецПроцедуры
